      *Divisao de identificacao de variaveis(Divisao)
       Identification Division.
      * Nome do Programa(Secao)
       Program-Id. hello_world.
      *Declaracao de Variaveis(Paragrafo)
      *Sentencas
      *Statements
      *characters
       Data Division.
       Working-Storage Section.


       Procedure Division.
           
           GoBack.
       End Program hello_world.      