       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP3.

       PROCEDURE DIVISION.
           A-PARA.
           PERFORM B-PARA 3 TIMES.
           STOP RUN.

           B-PARA.
           DISPLAY 'IN B-PARA'.
